{"weightsManifest": [{"paths": ["group1-shard1of2", "group1-shard2of2"], "weights": [{"dtype": "float32", "name": "dense_1_16/kernel", "shape": [7, 512]}, {"dtype": "float32", "name": "dense_1_16/bias", "shape": [512]}, {"dtype": "float32", "name": "dense_2_16/kernel", "shape": [512, 512]}, {"dtype": "float32", "name": "dense_2_16/bias", "shape": [512]}, {"dtype": "float32", "name": "dense_3_16/kernel", "shape": [512, 512]}, {"dtype": "float32", "name": "dense_3_16/bias", "shape": [512]}, {"dtype": "float32", "name": "dense_4_16/kernel", "shape": [512, 512]}, {"dtype": "float32", "name": "dense_4_16/bias", "shape": [512]}, {"dtype": "float32", "name": "dense_5_16/kernel", "shape": [512, 512]}, {"dtype": "float32", "name": "dense_5_16/bias", "shape": [512]}, {"dtype": "float32", "name": "dense_6_16/kernel", "shape": [512, 512]}, {"dtype": "float32", "name": "dense_6_16/bias", "shape": [512]}, {"dtype": "float32", "name": "dense_7_16/kernel", "shape": [512, 512]}, {"dtype": "float32", "name": "dense_7_16/bias", "shape": [512]}, {"dtype": "float32", "name": "dense_8_16/kernel", "shape": [512, 512]}, {"dtype": "float32", "name": "dense_8_16/bias", "shape": [512]}, {"dtype": "float32", "name": "dense_9_16/kernel", "shape": [512, 3]}, {"dtype": "float32", "name": "dense_9_16/bias", "shape": [3]}]}], "modelTopology": {"backend": "tensorflow", "keras_version": "2.2.2", "training_config": {"loss_weights": null, "sample_weight_mode": null, "metrics": ["mae", "acc"], "loss": "binary_crossentropy", "optimizer_config": {"class_name": "Adam", "config": {"beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "lr": 9.999999747378752e-06, "epsilon": 1e-07, "decay": 0.0, "amsgrad": false}}}, "model_config": {"class_name": "Sequential", "config": [{"class_name": "Dense", "config": {"kernel_constraint": null, "trainable": true, "bias_constraint": null, "activation": "relu", "dtype": "float32", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "use_bias": true, "batch_input_shape": [null, 7], "units": 512, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_1", "bias_regularizer": null}}, {"class_name": "Dropout", "config": {"seed": null, "noise_shape": null, "trainable": true, "name": "dropout_1", "rate": 0.050000000000000044}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "trainable": true, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "units": 512, "activation": "relu", "use_bias": true, "kernel_regularizer": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_2", "bias_regularizer": null}}, {"class_name": "Dropout", "config": {"seed": null, "noise_shape": null, "trainable": true, "name": "dropout_2", "rate": 0.050000000000000044}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "trainable": true, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "units": 512, "activation": "relu", "use_bias": true, "kernel_regularizer": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_3", "bias_regularizer": null}}, {"class_name": "Dropout", "config": {"seed": null, "noise_shape": null, "trainable": true, "name": "dropout_3", "rate": 0.050000000000000044}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "trainable": true, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "units": 512, "activation": "relu", "use_bias": true, "kernel_regularizer": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_4", "bias_regularizer": null}}, {"class_name": "Dropout", "config": {"seed": null, "noise_shape": null, "trainable": true, "name": "dropout_4", "rate": 0.050000000000000044}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "trainable": true, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "units": 512, "activation": "relu", "use_bias": true, "kernel_regularizer": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_5", "bias_regularizer": null}}, {"class_name": "Dropout", "config": {"seed": null, "noise_shape": null, "trainable": true, "name": "dropout_5", "rate": 0.050000000000000044}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "trainable": true, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "units": 512, "activation": "relu", "use_bias": true, "kernel_regularizer": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_6", "bias_regularizer": null}}, {"class_name": "Dropout", "config": {"seed": null, "noise_shape": null, "trainable": true, "name": "dropout_6", "rate": 0.050000000000000044}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "trainable": true, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "units": 512, "activation": "relu", "use_bias": true, "kernel_regularizer": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_7", "bias_regularizer": null}}, {"class_name": "Dropout", "config": {"seed": null, "noise_shape": null, "trainable": true, "name": "dropout_7", "rate": 0.050000000000000044}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "trainable": true, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "units": 512, "activation": "relu", "use_bias": true, "kernel_regularizer": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_8", "bias_regularizer": null}}, {"class_name": "Dropout", "config": {"seed": null, "noise_shape": null, "trainable": true, "name": "dropout_8", "rate": 0.050000000000000044}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "trainable": true, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "units": 3, "activation": "linear", "use_bias": true, "kernel_regularizer": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_9", "bias_regularizer": null}}]}}}